# coding=utf-8
q1 = """
什么是简单图？
"""

a1 = """
在无向图中, 如果关联一对顶点的无向边多于一条则称这条边为平行边, 平行边的条数叫做重数, 在有向图中, 如果关联一对顶点的
边多于一条且方向相同, 则这些边成为平行边; 自环是两端连接同一定点的边, 那么既无平行边也无自环的图叫简单图.
"""

q2 = """
何为正则图, 何为完全图, 证明完全图是正则图.
"""

a2 = """
完全图:
    每一对不同顶点恰有一条边可互达,也就是说假设无向图的定点数为n, 则边数目为n * (n - 1) / 2, 如果是有向图, 顶点数目为n,
    则边数为n * (n - 1).
正则图:
    各个定点的度都相同的无向图叫做正则图. 每个顶点的度如果为K, 则此图叫做"K-正则图".
完全图是N-1正则图:
    完全图的每个顶点的度为N-1, 所以是N-1正则图
"""

q3 = """
何为路径? 何为环?
"""

a3 = """
路径: 从一个顶点到另一个顶点经过所有的边的集合叫做路径.
环: 如果路径的收尾是同一个点则此路径为环.
"""

q4 = """
何为森林? 何为树? 说明: 如果每个节点都有到其他节点的路径, 那么这个图就是连通的.
"""

a4 = """
树: 无环连通图
森林: 多个树构成的图(树之间不连通).
"""

